{"pages":[{"title":"策略模式 Strategy","text":"About MePep/8 Assembly Language Simulator, https://github.com/GH-H/Pep-8-simulator Oct-Dec 2020","link":"/CyberCube/Projects/%E7%AD%96%E7%95%A5%E6%A8%A1%E5%BC%8F-Strategy.html"}],"posts":[{"title":"Introduction","text":"About MeWOOOOOOOOt up!!!!! Welcome to my little website. I called it CyberCube, This is the place belongs to me and filled with cyberpunk elements. Feel free to walk around. EducationUniversity of WashingtonBachelor of Science in Computer Science and Systems – (GPA: 3.46/4.0) Awards/Honors: Annual Dean’s List 2020-2021 Resume PDF Version View & Download Research ProjectDATABASE RESOURCE Administrator Directed and supervised a 2-man team to implement a desktop resource administrator system, from early designing to post-launch optimization.Successfully implemented a functional software and a sample SQLServer database with 1M random records with C# or .net Framework. Proposed Agile methodology for better flexibility and superior project predictability.Redesigned database schema in SQLserver, Effectively saw up to 13% reduction in reading queries time. Managed maintainable codebase by enforcing alignment with proper use of coding conventions.Compressed and optimized Time Elapsed Unit, facilitated up to 30% reduction in task processing time. ProjectsCustomerTrackerWebApp Developed a light-weighted web application with UI that tracks customer information. Delivered innovative features such as customer listing and performing CRUD on MySQL database through Hibernate API. Implemented service facade design pattern and added a service layer to integrate data from multiple sources. Utilized Spring Framework, JSP,Maven, Java, Tomcat, etc. Pep/8 Assembly Language Simulator Leveraged proficiency with Java to design and implement Pep/8 assembly language simulator with MVC architecture. Assumed responsibility as a backend developer and actively contributed towards integrated instruction Execution Unit into the core system. Utilized JUnit to design an Instruction model and implement extensive tests for each instruction class. Provided utility tools for positional number conversion and solved bit masturbation overflow issues.","link":"/CyberCube/2020/02/02/main/"}],"tags":[{"name":"About Me","slug":"About-Me","link":"/CyberCube/tags/About-Me/"}],"categories":[]}